# Ultralytics YOLO26 - Late-Stage Trash Architecture Blueprint (CBAM in BACKBONE)
nc: 3
end2end: True
reg_max: 1

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, CBAM, []]                  # 5  - FIXED Brackets (Filters early conveyor/dirt noise)
  - [-1, 1, Conv, [512, 3, 2]]         # 6-P4/16
  - [-1, 2, C3k2, [512, True]]         # 7
  - [-1, 1, CBAM, []]                  # 8  - FIXED Brackets (Amplifies crushed material textures)
  - [-1, 1, Conv, [1024, 3, 2]]        # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]        # 10
  - [-1, 1, SPPF, [1024, 5, 3, True]]  # 11
  - [-1, 2, C2PSA, [1024]]             # 12 

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 8], 1, Concat, [1]]                  # 14 - Connects to the texture-refined backbone P4 (Layer 8)
  - [-1, 2, C3k2, [512, True]]                 # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  - [[-1, 5], 1, Concat, [1]]                  # 17 - FIXED Routing: Connects to noise-filtered backbone P3 (Layer 5)
  - [-1, 2, C3k2, [256, True]]                 # 18 - Small target detection head

  - [-1, 1, Conv, [256, 3, 2]]                 # 19
  - [[-1, 15], 1, Concat, [1]]                 # 20 - Connects back to Layer 15
  - [-1, 2, C3k2, [512, True]]                 # 21 - Medium target detection head

  - [-1, 1, Conv, [512, 3, 2]]                 # 22
  - [[-1, 12], 1, Concat, [1]]                 # 23 - Connects to Layer 12 (Deep global context)
  - [-1, 1, C3k2, [1024, True, 0.5, True]]     # 24 - Large target detection head
  - [-1, 1, CBAM, []]                          # 25 - FIXED Brackets (Resolves overlapping boundaries)

  - [[18, 21, 25], 1, Detect, [nc]]            # 26 - Final prediction output map